{
  "url": "https://disk.yandex.com/d/xWjPLAEGJGGToQ",
  "file_name": "Vlasenko.registry.json",
  "description": "Modules by Michael Vlasenko",
  "modules":
  [
    {
       "download_url": "https://disk.yandex.com/d/i975N-oao3juxA",
       "file_name": "ITBY2+.zip",
       "language_code": "rus",
       "description": "Танах в подстрочном переводе на русский язык (Бытие - Малахия)",
       "update_date": "2023-10-17",
       "update_info": "(2023-10-17) Транскрипция убрана. Создан новый модуль ITBYM2+, который содержит транскрипцию.\n(2023-10-08) Теперь можно скрывать не только транскрипцию, граммемы и номера Стронга, но также и перевод; обнаружены и исправлены некоторые ошибки конвертации в граммемах и транскрипции.\n(2023-09-23) Множество исправлений в тексте:\n    - выявлены на русском местоимения, которых нет в оригинале, но которые ошибочно не помеченны курсивом;\n    - доработано проставление морфологического разделителя (серединной точки) между местоименными суффиксами/префиксами в переводе;\n   - исправлено в соответствии с числом:\n     • [в руку] — [в руки];\n     • [в руке] — [в руках];\n     • [из руки] — [из рук];\n   - перевод для слов с номерами Стронга 0606 и 0582 исправлены со [смертн*] на [мужей] или [людей].\n(2023-07-28) Небольшие исправления в тексте; в десяти стихах разделение слова на две лексемы: Ex 4:2 1Ch 15:13 1Ch 20:4 2Ch 20:1 2Ch 20:35 2Ch 24:4 Ps 106:1 Isa 3:15 Eze 8:6 Jon 1:7 Mal 1:13.\n(2023-07-17) После вычитки книг: Плач.\n(2023-07-12) После вычитки книг: Есф.\n(2023-07-10) После вычитки книг: Езд, Нее, Иоил, Мих, Соф, Агг; Опция [пояснения] снова переключает вывод на экран транскрипция как и прежде; добавлена расшифровка граммем непосредственно в модуль с текстом Библии, установка дополнительных словарей теперь для расшифровки не требуется.\n(2023-06-25) Небольшие исправления в тексте; Теперь Опция [пояснения] переключает вывод на экран граммем, а транскрипция включается, если активизировать опцию [морфологию] в диалоге [Отображать для номера]. Решена проблема, когда двойной тап по слову в словосочетании не приводил к появлению статьи из словаря.\n(2023-06-18) После вычитки книг: Втор; Из работы Analytical перенесены граммемы; Морфологические разделители приведены в полное соотвествие с Analytical\n(2023-06-16) Версия не конечная. То же, что и ITBY+, но с номерами Стронга взятыми из работы Analytical"
    },
    {
       "download_url": "https://disk.yandex.com/d/kq0UDv-3nK3y_Q",
       "file_name": "ITBYM2+.zip",
       "language_code": "rus",
       "description": "Танах в подстрочном переводе на русский язык с транскрипцией (Бытие - Малахия)",
       "update_date": "2023-18-10",
       "update_info": "(2023-18-10) То же, что и ITBY2+, но с транскрипцией."
    }
  ]
}